hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_jpeg_regs.h
/*
 * AXI_ERR_IRQ_EN (RW)
 *
 * In DMA axi bus error inetrrupt enable
 */
#define JPEG_INDMA_MISC_AXI_ERR_IRQ_EN_MASK (0x100U)
#define JPEG_INDMA_MISC_AXI_ERR_IRQ_EN_SHIFT (8U)
#define JPEG_INDMA_MISC_AXI_ERR_IRQ_EN_SET(x) (((uint32_t)(x) << JPEG_INDMA_MISC_AXI_ERR_IRQ_EN_SHIFT) & JPEG_INDMA_MISC_AXI_ERR_IRQ_EN_MASK)
#define JPEG_INDMA_MISC_AXI_ERR_IRQ_EN_GET(x) (((uint32_t)(x) & JPEG_INDMA_MISC_AXI_ERR_IRQ_EN_MASK) >> JPEG_INDMA_MISC_AXI_ERR_IRQ_EN_SHIFT)

/*
 * IRQ_EN (RW)
 *
 * interrupt enable for all interrupt sources of In DMA module
 */
#define JPEG_INDMA_MISC_IRQ_EN_MASK (0x80U)
#define JPEG_INDMA_MISC_IRQ_EN_SHIFT (7U)
#define JPEG_INDMA_MISC_IRQ_EN_SET(x) (((uint32_t)(x) << JPEG_INDMA_MISC_IRQ_EN_SHIFT) & JPEG_INDMA_MISC_IRQ_EN_MASK)
#define JPEG_INDMA_MISC_IRQ_EN_GET(x) (((uint32_t)(x) & JPEG_INDMA_MISC_IRQ_EN_MASK) >> JPEG_INDMA_MISC_IRQ_EN_SHIFT)

/*
 * IN_DMA_ID (RW)
 *
 * 0: Pixel (In)
 * 1: ECS (In)
 * 2: Qmem
 * 3: HuffEnc
 * 4: HuffMin
 * 5: HuffBase
 * 6: HuffSymb
 */
#define JPEG_INDMA_MISC_IN_DMA_ID_MASK (0x70U)
#define JPEG_INDMA_MISC_IN_DMA_ID_SHIFT (4U)
#define JPEG_INDMA_MISC_IN_DMA_ID_SET(x) (((uint32_t)(x) << JPEG_INDMA_MISC_IN_DMA_ID_SHIFT) & JPEG_INDMA_MISC_IN_DMA_ID_MASK)
#define JPEG_INDMA_MISC_IN_DMA_ID_GET(x) (((uint32_t)(x) & JPEG_INDMA_MISC_IN_DMA_ID_MASK) >> JPEG_INDMA_MISC_IN_DMA_ID_SHIFT)

/*
 * IN_DMA_REQ (RW)
 *
 * Asserted to request DMA. Automatically clear after DMA is done.
 */
#define JPEG_INDMA_MISC_IN_DMA_REQ_MASK (0x8U)
#define JPEG_INDMA_MISC_IN_DMA_REQ_SHIFT (3U)
#define JPEG_INDMA_MISC_IN_DMA_REQ_SET(x) (((uint32_t)(x) << JPEG_INDMA_MISC_IN_DMA_REQ_SHIFT) & JPEG_INDMA_MISC_IN_DMA_REQ_MASK)
#define JPEG_INDMA_MISC_IN_DMA_REQ_GET(x) (((uint32_t)(x) & JPEG_INDMA_MISC_IN_DMA_REQ_MASK) >> JPEG_INDMA_MISC_IN_DMA_REQ_SHIFT)

/*
 * INDMA2D (RW)
 *
 * Asserted if In_DMA_ID=Pixel.
 */
#define JPEG_INDMA_MISC_INDMA2D_MASK (0x4U)
#define JPEG_INDMA_MISC_INDMA2D_SHIFT (2U)
#define JPEG_INDMA_MISC_INDMA2D_SET(x) (((uint32_t)(x) << JPEG_INDMA_MISC_INDMA2D_SHIFT) & JPEG_INDMA_MISC_INDMA2D_MASK)
#define JPEG_INDMA_MISC_INDMA2D_GET(x) (((uint32_t)(x) & JPEG_INDMA_MISC_INDMA2D_MASK) >> JPEG_INDMA_MISC_INDMA2D_SHIFT)

/* Bitfield definition for register: INDMABASE */
/*
 * ADDR (RW)
 *
 * Y plane (or Encoded Bit Plane)
 */
#define JPEG_INDMABASE_ADDR_MASK (0xFFFFFFFFUL)
#define JPEG_INDMABASE_ADDR_SHIFT (0U)
#define JPEG_INDMABASE_ADDR_SET(x) (((uint32_t)(x) << JPEG_INDMABASE_ADDR_SHIFT) & JPEG_INDMABASE_ADDR_MASK)
#define JPEG_INDMABASE_ADDR_GET(x) (((uint32_t)(x) & JPEG_INDMABASE_ADDR_MASK) >> JPEG_INDMABASE_ADDR_SHIFT)

/* Bitfield definition for register: INDMA_CTRL0 */
/*
 * TTLEN (RW)
 *
 * Total length (Low 16 bits) in Bytes -1 for transfer when  In_DMA_ID!=Pixel.
 */
#define JPEG_INDMA_CTRL0_TTLEN_MASK (0xFFFF0000UL)
#define JPEG_INDMA_CTRL0_TTLEN_SHIFT (16U)
#define JPEG_INDMA_CTRL0_TTLEN_SET(x) (((uint32_t)(x) << JPEG_INDMA_CTRL0_TTLEN_SHIFT) & JPEG_INDMA_CTRL0_TTLEN_MASK)
#define JPEG_INDMA_CTRL0_TTLEN_GET(x) (((uint32_t)(x) & JPEG_INDMA_CTRL0_TTLEN_MASK) >> JPEG_INDMA_CTRL0_TTLEN_SHIFT)

/*
 * PITCH (RW)
 *
 * Pitch between the starting point of Rows. Only active when  In_DMA_ID=Pixel..
 */
#define JPEG_INDMA_CTRL0_PITCH_MASK (0xFFFFU)
#define JPEG_INDMA_CTRL0_PITCH_SHIFT (0U)
#define JPEG_INDMA_CTRL0_PITCH_SET(x) (((uint32_t)(x) << JPEG_INDMA_CTRL0_PITCH_SHIFT) & JPEG_INDMA_CTRL0_PITCH_MASK)
#define JPEG_INDMA_CTRL0_PITCH_GET(x) (((uint32_t)(x) & JPEG_INDMA_CTRL0_PITCH_MASK) >> JPEG_INDMA_CTRL0_PITCH_SHIFT)

/* Bitfield definition for register: INDMA_CTRL1 */
/*
 * ROWLEN (RW)
 *
 * Total length (High 16 bits) in Bytes -1 for transfer. See reference in InDMA_Ctrl0[TTLEN]
 */
#define JPEG_INDMA_CTRL1_ROWLEN_MASK (0xFFFFU)
#define JPEG_INDMA_CTRL1_ROWLEN_SHIFT (0U)
#define JPEG_INDMA_CTRL1_ROWLEN_SET(x) (((uint32_t)(x) << JPEG_INDMA_CTRL1_ROWLEN_SHIFT) & JPEG_INDMA_CTRL1_ROWLEN_MASK)
#define JPEG_INDMA_CTRL1_ROWLEN_GET(x) (((uint32_t)(x) & JPEG_INDMA_CTRL1_ROWLEN_MASK) >> JPEG_INDMA_CTRL1_ROWLEN_SHIFT)

/* Bitfield definition for register: INXT_CMD */
/*
 * ADDR (RW)
 *
 * The address pointing to the next command
 */
#define JPEG_INXT_CMD_ADDR_MASK (0xFFFFFFFCUL)
#define JPEG_INXT_CMD_ADDR_SHIFT (2U)
#define JPEG_INXT_CMD_ADDR_SET(x) (((uint32_t)(x) << JPEG_INXT_CMD_ADDR_SHIFT) & JPEG_INXT_CMD_ADDR_MASK)
#define JPEG_INXT_CMD_ADDR_GET(x) (((uint32_t)(x) & JPEG_INXT_CMD_ADDR_MASK) >> JPEG_INXT_CMD_ADDR_SHIFT)

/*
 * OP_VALID (rw)
 *
 * asserted if there is either a DATA DMA phase or NXTCMD phase. Automatically cleared. Will trigger the InDMA transfer if CFG[JPEG_EN] is 1.
 */
#define JPEG_INXT_CMD_OP_VALID_MASK (0x2U)
#define JPEG_INXT_CMD_OP_VALID_SHIFT (1U)
#define JPEG_INXT_CMD_OP_VALID_SET(x) (((uint32_t)(x) << JPEG_INXT_CMD_OP_VALID_SHIFT) & JPEG_INXT_CMD_OP_VALID_MASK)
#define JPEG_INXT_CMD_OP_VALID_GET(x) (((uint32_t)(x) & JPEG_INXT_CMD_OP_VALID_MASK) >> JPEG_INXT_CMD_OP_VALID_SHIFT)

/*
 * EN (RW)
 *
 * NXTCMD phase Enable Bit
 */
#define JPEG_INXT_CMD_EN_MASK (0x1U)
#define JPEG_INXT_CMD_EN_SHIFT (0U)
#define JPEG_INXT_CMD_EN_SET(x) (((uint32_t)(x) << JPEG_INXT_CMD_EN_SHIFT) & JPEG_INXT_CMD_EN_MASK)
#define JPEG_INXT_CMD_EN_GET(x) (((uint32_t)(x) & JPEG_INXT_CMD_EN_MASK) >> JPEG_INXT_CMD_EN_SHIFT)

/* Bitfield definition for register: OUTDMA_MISC */
/*
 * AWQOS (RW)
 *
 */
#define JPEG_OUTDMA_MISC_AWQOS_MASK (0x3C000UL)
#define JPEG_OUTDMA_MISC_AWQOS_SHIFT (14U)
#define JPEG_OUTDMA_MISC_AWQOS_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_AWQOS_SHIFT) & JPEG_OUTDMA_MISC_AWQOS_MASK)
#define JPEG_OUTDMA_MISC_AWQOS_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_AWQOS_MASK) >> JPEG_OUTDMA_MISC_AWQOS_SHIFT)

/*
 * PACK_DIR (RW)
 *
 * Decide the byte sequence of the 32-bit word {A3, A2, A1, A0}. The bit sequence in a byte is not changed. All outdma data are impacted.
 * 2'b00: no change {A3, A2, A1, A0} (This is used for ecs stream)
 * 2'b01: {A2, A3, A0, A1}
 * 2'b10: {A1, A0, A3, A2}
 * 2'b11: {A0, A1, A2, A3}
 */
#define JPEG_OUTDMA_MISC_PACK_DIR_MASK (0x3000U)
#define JPEG_OUTDMA_MISC_PACK_DIR_SHIFT (12U)
#define JPEG_OUTDMA_MISC_PACK_DIR_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_PACK_DIR_SHIFT) & JPEG_OUTDMA_MISC_PACK_DIR_MASK)
#define JPEG_OUTDMA_MISC_PACK_DIR_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_PACK_DIR_MASK) >> JPEG_OUTDMA_MISC_PACK_DIR_SHIFT)

