hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_jpeg_regs.h
/*
 * EN_OUTCNT (RW)
 *
 * Enable output counter (unit as bytes)
 */
#define JPEG_OUTDMA_MISC_EN_OUTCNT_MASK (0x800U)
#define JPEG_OUTDMA_MISC_EN_OUTCNT_SHIFT (11U)
#define JPEG_OUTDMA_MISC_EN_OUTCNT_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_EN_OUTCNT_SHIFT) & JPEG_OUTDMA_MISC_EN_OUTCNT_MASK)
#define JPEG_OUTDMA_MISC_EN_OUTCNT_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_EN_OUTCNT_MASK) >> JPEG_OUTDMA_MISC_EN_OUTCNT_SHIFT)

/*
 * INI_OUTCNT (RW)
 *
 * Asserted to ini output counter
 */
#define JPEG_OUTDMA_MISC_INI_OUTCNT_MASK (0x400U)
#define JPEG_OUTDMA_MISC_INI_OUTCNT_SHIFT (10U)
#define JPEG_OUTDMA_MISC_INI_OUTCNT_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_INI_OUTCNT_SHIFT) & JPEG_OUTDMA_MISC_INI_OUTCNT_MASK)
#define JPEG_OUTDMA_MISC_INI_OUTCNT_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_INI_OUTCNT_MASK) >> JPEG_OUTDMA_MISC_INI_OUTCNT_SHIFT)

/*
 * ADD_ODMA_ENDINGS (RW)
 *
 * Add 0xFFD9 to the ending of the odma stream when all original image pixels are processed by the encoder module.
 */
#define JPEG_OUTDMA_MISC_ADD_ODMA_ENDINGS_MASK (0x200U)
#define JPEG_OUTDMA_MISC_ADD_ODMA_ENDINGS_SHIFT (9U)
#define JPEG_OUTDMA_MISC_ADD_ODMA_ENDINGS_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_ADD_ODMA_ENDINGS_SHIFT) & JPEG_OUTDMA_MISC_ADD_ODMA_ENDINGS_MASK)
#define JPEG_OUTDMA_MISC_ADD_ODMA_ENDINGS_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_ADD_ODMA_ENDINGS_MASK) >> JPEG_OUTDMA_MISC_ADD_ODMA_ENDINGS_SHIFT)

/*
 * NXT_IRQ_EN (RW)
 *
 * Out DMA Next Interrupt Enable
 */
#define JPEG_OUTDMA_MISC_NXT_IRQ_EN_MASK (0x100U)
#define JPEG_OUTDMA_MISC_NXT_IRQ_EN_SHIFT (8U)
#define JPEG_OUTDMA_MISC_NXT_IRQ_EN_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_NXT_IRQ_EN_SHIFT) & JPEG_OUTDMA_MISC_NXT_IRQ_EN_MASK)
#define JPEG_OUTDMA_MISC_NXT_IRQ_EN_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_NXT_IRQ_EN_MASK) >> JPEG_OUTDMA_MISC_NXT_IRQ_EN_SHIFT)

/*
 * OUT_DMA_DONE_IRQ_EN (RW)
 *
 * Out DMA Done interrupt Enable
 */
#define JPEG_OUTDMA_MISC_OUT_DMA_DONE_IRQ_EN_MASK (0x80U)
#define JPEG_OUTDMA_MISC_OUT_DMA_DONE_IRQ_EN_SHIFT (7U)
#define JPEG_OUTDMA_MISC_OUT_DMA_DONE_IRQ_EN_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_OUT_DMA_DONE_IRQ_EN_SHIFT) & JPEG_OUTDMA_MISC_OUT_DMA_DONE_IRQ_EN_MASK)
#define JPEG_OUTDMA_MISC_OUT_DMA_DONE_IRQ_EN_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_OUT_DMA_DONE_IRQ_EN_MASK) >> JPEG_OUTDMA_MISC_OUT_DMA_DONE_IRQ_EN_SHIFT)

/*
 * AXI_ERR_IRQ_EN (RW)
 *
 * Out DMA axi bus error inetrrupt enable
 */
#define JPEG_OUTDMA_MISC_AXI_ERR_IRQ_EN_MASK (0x40U)
#define JPEG_OUTDMA_MISC_AXI_ERR_IRQ_EN_SHIFT (6U)
#define JPEG_OUTDMA_MISC_AXI_ERR_IRQ_EN_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_AXI_ERR_IRQ_EN_SHIFT) & JPEG_OUTDMA_MISC_AXI_ERR_IRQ_EN_MASK)
#define JPEG_OUTDMA_MISC_AXI_ERR_IRQ_EN_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_AXI_ERR_IRQ_EN_MASK) >> JPEG_OUTDMA_MISC_AXI_ERR_IRQ_EN_SHIFT)

/*
 * IRQ_EN (RW)
 *
 * interrupt enable for all interrupt sources of Out DMA module
 */
#define JPEG_OUTDMA_MISC_IRQ_EN_MASK (0x20U)
#define JPEG_OUTDMA_MISC_IRQ_EN_SHIFT (5U)
#define JPEG_OUTDMA_MISC_IRQ_EN_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_IRQ_EN_SHIFT) & JPEG_OUTDMA_MISC_IRQ_EN_MASK)
#define JPEG_OUTDMA_MISC_IRQ_EN_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_IRQ_EN_MASK) >> JPEG_OUTDMA_MISC_IRQ_EN_SHIFT)

/*
 * OUT_DMA_ID (RW)
 *
 * 0: Pixel (Out)
 * 1: ECS (Out)
 */
#define JPEG_OUTDMA_MISC_OUT_DMA_ID_MASK (0x10U)
#define JPEG_OUTDMA_MISC_OUT_DMA_ID_SHIFT (4U)
#define JPEG_OUTDMA_MISC_OUT_DMA_ID_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_OUT_DMA_ID_SHIFT) & JPEG_OUTDMA_MISC_OUT_DMA_ID_MASK)
#define JPEG_OUTDMA_MISC_OUT_DMA_ID_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_OUT_DMA_ID_MASK) >> JPEG_OUTDMA_MISC_OUT_DMA_ID_SHIFT)

/*
 * OUT_DMA_REQ (RW)
 *
 * Asserted to enable Out DMA request
 */
#define JPEG_OUTDMA_MISC_OUT_DMA_REQ_MASK (0x8U)
#define JPEG_OUTDMA_MISC_OUT_DMA_REQ_SHIFT (3U)
#define JPEG_OUTDMA_MISC_OUT_DMA_REQ_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_OUT_DMA_REQ_SHIFT) & JPEG_OUTDMA_MISC_OUT_DMA_REQ_MASK)
#define JPEG_OUTDMA_MISC_OUT_DMA_REQ_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_OUT_DMA_REQ_MASK) >> JPEG_OUTDMA_MISC_OUT_DMA_REQ_SHIFT)

/*
 * OUTDMA2D (RW)
 *
 * Asserted if Out_DMA_ID==Pixel
 */
#define JPEG_OUTDMA_MISC_OUTDMA2D_MASK (0x4U)
#define JPEG_OUTDMA_MISC_OUTDMA2D_SHIFT (2U)
#define JPEG_OUTDMA_MISC_OUTDMA2D_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_MISC_OUTDMA2D_SHIFT) & JPEG_OUTDMA_MISC_OUTDMA2D_MASK)
#define JPEG_OUTDMA_MISC_OUTDMA2D_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_MISC_OUTDMA2D_MASK) >> JPEG_OUTDMA_MISC_OUTDMA2D_SHIFT)

/* Bitfield definition for register: OUTDMABASE */
/*
 * ADDR (RW)
 *
 * Y plane (or Encoded Bit Plane)
 */
#define JPEG_OUTDMABASE_ADDR_MASK (0xFFFFFFFFUL)
#define JPEG_OUTDMABASE_ADDR_SHIFT (0U)
#define JPEG_OUTDMABASE_ADDR_SET(x) (((uint32_t)(x) << JPEG_OUTDMABASE_ADDR_SHIFT) & JPEG_OUTDMABASE_ADDR_MASK)
#define JPEG_OUTDMABASE_ADDR_GET(x) (((uint32_t)(x) & JPEG_OUTDMABASE_ADDR_MASK) >> JPEG_OUTDMABASE_ADDR_SHIFT)

/* Bitfield definition for register: OUTDMA_CTRL0 */
/*
 * TTLEN (RW)
 *
 * Total length (Low 16 bits) in Bytes -1 for transfer when  Out_DMA_ID!=Pixel.  If Out_DMA_ID=ECS, it can be any value greater than the length of the ECS, for example, the number of encoded bytes.
 */
#define JPEG_OUTDMA_CTRL0_TTLEN_MASK (0xFFFF0000UL)
#define JPEG_OUTDMA_CTRL0_TTLEN_SHIFT (16U)
#define JPEG_OUTDMA_CTRL0_TTLEN_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_CTRL0_TTLEN_SHIFT) & JPEG_OUTDMA_CTRL0_TTLEN_MASK)
#define JPEG_OUTDMA_CTRL0_TTLEN_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_CTRL0_TTLEN_MASK) >> JPEG_OUTDMA_CTRL0_TTLEN_SHIFT)

/*
 * PITCH (RW)
 *
 * Pitch between the starting point of Rows when Out_DMA_ID==Pixel
 */
#define JPEG_OUTDMA_CTRL0_PITCH_MASK (0xFFFFU)
#define JPEG_OUTDMA_CTRL0_PITCH_SHIFT (0U)
#define JPEG_OUTDMA_CTRL0_PITCH_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_CTRL0_PITCH_SHIFT) & JPEG_OUTDMA_CTRL0_PITCH_MASK)
#define JPEG_OUTDMA_CTRL0_PITCH_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_CTRL0_PITCH_MASK) >> JPEG_OUTDMA_CTRL0_PITCH_SHIFT)

/* Bitfield definition for register: OUTDMA_CTRL1 */
/*
 * ROWLEN (RW)
 *
 * Total length (High 16 bits) in Bytes -1 for transfer. See reference in OutDMA_Ctrl0[TTLEN]
 */
#define JPEG_OUTDMA_CTRL1_ROWLEN_MASK (0xFFFFU)
#define JPEG_OUTDMA_CTRL1_ROWLEN_SHIFT (0U)
#define JPEG_OUTDMA_CTRL1_ROWLEN_SET(x) (((uint32_t)(x) << JPEG_OUTDMA_CTRL1_ROWLEN_SHIFT) & JPEG_OUTDMA_CTRL1_ROWLEN_MASK)
#define JPEG_OUTDMA_CTRL1_ROWLEN_GET(x) (((uint32_t)(x) & JPEG_OUTDMA_CTRL1_ROWLEN_MASK) >> JPEG_OUTDMA_CTRL1_ROWLEN_SHIFT)

/* Bitfield definition for register: ONXT_CMD */
/*
 * ADDR (RW)
 *
 * The address pointing to the next command
 */
#define JPEG_ONXT_CMD_ADDR_MASK (0xFFFFFFFCUL)
#define JPEG_ONXT_CMD_ADDR_SHIFT (2U)
#define JPEG_ONXT_CMD_ADDR_SET(x) (((uint32_t)(x) << JPEG_ONXT_CMD_ADDR_SHIFT) & JPEG_ONXT_CMD_ADDR_MASK)
#define JPEG_ONXT_CMD_ADDR_GET(x) (((uint32_t)(x) & JPEG_ONXT_CMD_ADDR_MASK) >> JPEG_ONXT_CMD_ADDR_SHIFT)

