hpmicro/rtt-bsp-hpm6750evkmini/libraries/hpm_sdk/soc/ip/hpm_jpeg_regs.h
/*
 * Y_OFFSET (RW)
 *
 * CSC parameters Y_OFFSET
 */
#define JPEG_RGB2YUV_COEF0_Y_OFFSET_MASK (0x1FFU)
#define JPEG_RGB2YUV_COEF0_Y_OFFSET_SHIFT (0U)
#define JPEG_RGB2YUV_COEF0_Y_OFFSET_SET(x) (((uint32_t)(x) << JPEG_RGB2YUV_COEF0_Y_OFFSET_SHIFT) & JPEG_RGB2YUV_COEF0_Y_OFFSET_MASK)
#define JPEG_RGB2YUV_COEF0_Y_OFFSET_GET(x) (((uint32_t)(x) & JPEG_RGB2YUV_COEF0_Y_OFFSET_MASK) >> JPEG_RGB2YUV_COEF0_Y_OFFSET_SHIFT)

/* Bitfield definition for register: RGB2YUV_COEF1 */
/*
 * C1 (RW)
 *
 * CSC parameters C1
 */
#define JPEG_RGB2YUV_COEF1_C1_MASK (0x7FF0000UL)
#define JPEG_RGB2YUV_COEF1_C1_SHIFT (16U)
#define JPEG_RGB2YUV_COEF1_C1_SET(x) (((uint32_t)(x) << JPEG_RGB2YUV_COEF1_C1_SHIFT) & JPEG_RGB2YUV_COEF1_C1_MASK)
#define JPEG_RGB2YUV_COEF1_C1_GET(x) (((uint32_t)(x) & JPEG_RGB2YUV_COEF1_C1_MASK) >> JPEG_RGB2YUV_COEF1_C1_SHIFT)

/*
 * C4 (RW)
 *
 * CSC parameters C4
 */
#define JPEG_RGB2YUV_COEF1_C4_MASK (0x7FFU)
#define JPEG_RGB2YUV_COEF1_C4_SHIFT (0U)
#define JPEG_RGB2YUV_COEF1_C4_SET(x) (((uint32_t)(x) << JPEG_RGB2YUV_COEF1_C4_SHIFT) & JPEG_RGB2YUV_COEF1_C4_MASK)
#define JPEG_RGB2YUV_COEF1_C4_GET(x) (((uint32_t)(x) & JPEG_RGB2YUV_COEF1_C4_MASK) >> JPEG_RGB2YUV_COEF1_C4_SHIFT)

/* Bitfield definition for register: RGB2YUV_COEF2 */
/*
 * C2 (RW)
 *
 * CSC parameters C2
 */
#define JPEG_RGB2YUV_COEF2_C2_MASK (0x7FF0000UL)
#define JPEG_RGB2YUV_COEF2_C2_SHIFT (16U)
#define JPEG_RGB2YUV_COEF2_C2_SET(x) (((uint32_t)(x) << JPEG_RGB2YUV_COEF2_C2_SHIFT) & JPEG_RGB2YUV_COEF2_C2_MASK)
#define JPEG_RGB2YUV_COEF2_C2_GET(x) (((uint32_t)(x) & JPEG_RGB2YUV_COEF2_C2_MASK) >> JPEG_RGB2YUV_COEF2_C2_SHIFT)

/*
 * C3 (RW)
 *
 * CSC parameters C3
 */
#define JPEG_RGB2YUV_COEF2_C3_MASK (0x7FFU)
#define JPEG_RGB2YUV_COEF2_C3_SHIFT (0U)
#define JPEG_RGB2YUV_COEF2_C3_SET(x) (((uint32_t)(x) << JPEG_RGB2YUV_COEF2_C3_SHIFT) & JPEG_RGB2YUV_COEF2_C3_MASK)
#define JPEG_RGB2YUV_COEF2_C3_GET(x) (((uint32_t)(x) & JPEG_RGB2YUV_COEF2_C3_MASK) >> JPEG_RGB2YUV_COEF2_C3_SHIFT)

/* Bitfield definition for register: RGB2YUV_COEF3 */
/*
 * C6 (RW)
 *
 * CSC parameters C6
 */
#define JPEG_RGB2YUV_COEF3_C6_MASK (0x7FF0000UL)
#define JPEG_RGB2YUV_COEF3_C6_SHIFT (16U)
#define JPEG_RGB2YUV_COEF3_C6_SET(x) (((uint32_t)(x) << JPEG_RGB2YUV_COEF3_C6_SHIFT) & JPEG_RGB2YUV_COEF3_C6_MASK)
#define JPEG_RGB2YUV_COEF3_C6_GET(x) (((uint32_t)(x) & JPEG_RGB2YUV_COEF3_C6_MASK) >> JPEG_RGB2YUV_COEF3_C6_SHIFT)

/*
 * C5 (RW)
 *
 * CSC parameters C5
 */
#define JPEG_RGB2YUV_COEF3_C5_MASK (0x7FFU)
#define JPEG_RGB2YUV_COEF3_C5_SHIFT (0U)
#define JPEG_RGB2YUV_COEF3_C5_SET(x) (((uint32_t)(x) << JPEG_RGB2YUV_COEF3_C5_SHIFT) & JPEG_RGB2YUV_COEF3_C5_MASK)
#define JPEG_RGB2YUV_COEF3_C5_GET(x) (((uint32_t)(x) & JPEG_RGB2YUV_COEF3_C5_MASK) >> JPEG_RGB2YUV_COEF3_C5_SHIFT)

/* Bitfield definition for register: RGB2YUV_COEF4 */
/*
 * C8 (RW)
 *
 * CSC parameters C8
 */
#define JPEG_RGB2YUV_COEF4_C8_MASK (0x7FF0000UL)
#define JPEG_RGB2YUV_COEF4_C8_SHIFT (16U)
#define JPEG_RGB2YUV_COEF4_C8_SET(x) (((uint32_t)(x) << JPEG_RGB2YUV_COEF4_C8_SHIFT) & JPEG_RGB2YUV_COEF4_C8_MASK)
#define JPEG_RGB2YUV_COEF4_C8_GET(x) (((uint32_t)(x) & JPEG_RGB2YUV_COEF4_C8_MASK) >> JPEG_RGB2YUV_COEF4_C8_SHIFT)

/*
 * C7 (RW)
 *
 * CSC parameters C7
 */
#define JPEG_RGB2YUV_COEF4_C7_MASK (0x7FFU)
#define JPEG_RGB2YUV_COEF4_C7_SHIFT (0U)
#define JPEG_RGB2YUV_COEF4_C7_SET(x) (((uint32_t)(x) << JPEG_RGB2YUV_COEF4_C7_SHIFT) & JPEG_RGB2YUV_COEF4_C7_MASK)
#define JPEG_RGB2YUV_COEF4_C7_GET(x) (((uint32_t)(x) & JPEG_RGB2YUV_COEF4_C7_MASK) >> JPEG_RGB2YUV_COEF4_C7_SHIFT)

/* Bitfield definition for register: IMGREG1 */
/*
 * RE (RW)
 *
 * Encoder Use only.
 * Asseted to enable the Restart Marker processing. A Restart Marker is inserted in the outputted ECS (Entropy Coded Segment) every NRST+1 MCUs
 */
#define JPEG_IMGREG1_RE_MASK (0x4U)
#define JPEG_IMGREG1_RE_SHIFT (2U)
#define JPEG_IMGREG1_RE_SET(x) (((uint32_t)(x) << JPEG_IMGREG1_RE_SHIFT) & JPEG_IMGREG1_RE_MASK)
#define JPEG_IMGREG1_RE_GET(x) (((uint32_t)(x) & JPEG_IMGREG1_RE_MASK) >> JPEG_IMGREG1_RE_SHIFT)

/*
 * NCOL (RW)
 *
 * Ncol is the number of color components in the image data to process minus 1. For example, for a grayscale image Ncol=0, for an RGB image, Ncol=2
 */
#define JPEG_IMGREG1_NCOL_MASK (0x3U)
#define JPEG_IMGREG1_NCOL_SHIFT (0U)
#define JPEG_IMGREG1_NCOL_SET(x) (((uint32_t)(x) << JPEG_IMGREG1_NCOL_SHIFT) & JPEG_IMGREG1_NCOL_MASK)
#define JPEG_IMGREG1_NCOL_GET(x) (((uint32_t)(x) & JPEG_IMGREG1_NCOL_MASK) >> JPEG_IMGREG1_NCOL_SHIFT)

/* Bitfield definition for register: IMGREG2 */
/*
 * NMCU (RW)
 *
 * Encoder Use only.
 * The number of NMCU to be generated in encoder mode
 */
#define JPEG_IMGREG2_NMCU_MASK (0x3FFFFFFUL)
#define JPEG_IMGREG2_NMCU_SHIFT (0U)
#define JPEG_IMGREG2_NMCU_SET(x) (((uint32_t)(x) << JPEG_IMGREG2_NMCU_SHIFT) & JPEG_IMGREG2_NMCU_MASK)
#define JPEG_IMGREG2_NMCU_GET(x) (((uint32_t)(x) & JPEG_IMGREG2_NMCU_MASK) >> JPEG_IMGREG2_NMCU_SHIFT)

/* Bitfield definition for register: IMGREG3 */
/*
 * NRST (RW)
 *
 * Encoder use only.
 * It is the number of MCUs between two Restart Markers (if enabled) minus 1. The content of this register is ignored if the Re bit inregister 1 is not set.
 */
#define JPEG_IMGREG3_NRST_MASK (0xFFFFU)
#define JPEG_IMGREG3_NRST_SHIFT (0U)
#define JPEG_IMGREG3_NRST_SET(x) (((uint32_t)(x) << JPEG_IMGREG3_NRST_SHIFT) & JPEG_IMGREG3_NRST_MASK)
#define JPEG_IMGREG3_NRST_GET(x) (((uint32_t)(x) & JPEG_IMGREG3_NRST_MASK) >> JPEG_IMGREG3_NRST_SHIFT)

/* Bitfield definition for register array: IMGREG */
/*
 * NBLOCK (RW)
 *
 * Encoder use only.
 * The number of data units (8x8 blocks of data) of the color componet contained in the MCU minus 1.
 */
#define JPEG_IMGREG_NBLOCK_MASK (0xF0U)
#define JPEG_IMGREG_NBLOCK_SHIFT (4U)
#define JPEG_IMGREG_NBLOCK_SET(x) (((uint32_t)(x) << JPEG_IMGREG_NBLOCK_SHIFT) & JPEG_IMGREG_NBLOCK_MASK)
#define JPEG_IMGREG_NBLOCK_GET(x) (((uint32_t)(x) & JPEG_IMGREG_NBLOCK_MASK) >> JPEG_IMGREG_NBLOCK_SHIFT)

/*
 * QT (RW)
 *
 * Encoder use only.
 * The selection of the quantization table.
 */
#define JPEG_IMGREG_QT_MASK (0xCU)
#define JPEG_IMGREG_QT_SHIFT (2U)
#define JPEG_IMGREG_QT_SET(x) (((uint32_t)(x) << JPEG_IMGREG_QT_SHIFT) & JPEG_IMGREG_QT_MASK)
#define JPEG_IMGREG_QT_GET(x) (((uint32_t)(x) & JPEG_IMGREG_QT_MASK) >> JPEG_IMGREG_QT_SHIFT)

/*
 * HA (RW)
 *
 * Encoder use only.
 * The selection of the Huffman table for the encoding of the AC coefficients in the data units belonging to the color component.
 */
#define JPEG_IMGREG_HA_MASK (0x2U)
#define JPEG_IMGREG_HA_SHIFT (1U)
#define JPEG_IMGREG_HA_SET(x) (((uint32_t)(x) << JPEG_IMGREG_HA_SHIFT) & JPEG_IMGREG_HA_MASK)
#define JPEG_IMGREG_HA_GET(x) (((uint32_t)(x) & JPEG_IMGREG_HA_MASK) >> JPEG_IMGREG_HA_SHIFT)

/*
 * HD (RW)
 *
 * Encoder use only.
 * The selection of the Huffman table for the encoding of the DC coefficients in the data units belonging to the color component.
 */
#define JPEG_IMGREG_HD_MASK (0x1U)
#define JPEG_IMGREG_HD_SHIFT (0U)
#define JPEG_IMGREG_HD_SET(x) (((uint32_t)(x) << JPEG_IMGREG_HD_SHIFT) & JPEG_IMGREG_HD_MASK)
#define JPEG_IMGREG_HD_GET(x) (((uint32_t)(x) & JPEG_IMGREG_HD_MASK) >> JPEG_IMGREG_HD_SHIFT)



/* IMGREG register group index macro definition */
#define JPEG_IMGREG_REG40 (0UL)
#define JPEG_IMGREG_REG41 (1UL)
#define JPEG_IMGREG_REG42 (2UL)
#define JPEG_IMGREG_REG43 (3UL)


#endif /* HPM_JPEG_H */